/*
SQLyog 企业版 - MySQL GUI v8.14 
MySQL - 5.5.20-log : Database - brian_lib
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`brian_lib` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `brian_lib`;

/*Table structure for table `courses` */

DROP TABLE IF EXISTS `courses`;

CREATE TABLE `courses` (
  `courses_id` varchar(10) NOT NULL COMMENT '课程编号',
  `courses_name` varchar(100) NOT NULL COMMENT '课程名称',
  `courses_credit` int(11) NOT NULL COMMENT '课程学分',
  `courses_type` varchar(20) DEFAULT NULL COMMENT '课程类型',
  PRIMARY KEY (`courses_id`,`courses_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `courses` */

LOCK TABLES `courses` WRITE;

insert  into `courses`(`courses_id`,`courses_name`,`courses_credit`,`courses_type`) values ('130600020','计算机网络',5,'专业必修课程'),('130600021','计算机网络实验',2,'专业必修课程'),('130600027','人工智能导论',2,'专业选修课程'),('130600028','算法设计与分析',2,'专业选修课程'),('130600042','操作系统',3,'专业必修课程'),('130600043','操作系统实验',1,'专业必修课程'),('130600061','面向对象分析与设计',7,'专业选修课程'),('130600062','面向对象分析与设计实验',6,'专业选修课程'),('130600086','软件工程导论',1,'专业选修课程'),('130600087','软件工程导论实验',1,'专业选修课程'),('130600092','微机原理与接口技术',3,'专业选修课程'),('130600098','高级网站开发技术',1,'专业选修课程'),('130600105','数字通信原理',1,'专业选修课程'),('130600454','操作系统课程设计',2,'集中性实践教学环节'),('130600703','微机原理与接口技术实验Ⅲ',4,'专业选修课程'),('136300802','毛泽东思想和中国特色社会主义理论体系概论',5,'通识类必修课程');

UNLOCK TABLES;

/*Table structure for table `score` */

DROP TABLE IF EXISTS `score`;

CREATE TABLE `score` (
  `score_id` varchar(10) NOT NULL COMMENT '成绩编号',
  `score_course_id` varchar(10) NOT NULL COMMENT '课程编号',
  `score_student_id` varchar(100) NOT NULL COMMENT '学生编号',
  `score_num` int(11) DEFAULT '0' COMMENT '成绩数字',
  `score_year` varchar(15) NOT NULL COMMENT '开课学年',
  `score_semester` varchar(15) NOT NULL COMMENT '开课学期',
  PRIMARY KEY (`score_id`),
  KEY `FK_score_users_id` (`score_student_id`),
  KEY `FK_score_courses_id` (`score_course_id`),
  CONSTRAINT `FK_score_courses_id` FOREIGN KEY (`score_course_id`) REFERENCES `courses` (`courses_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `FK_score_users_id` FOREIGN KEY (`score_student_id`) REFERENCES `users` (`users_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `score` */

LOCK TABLES `score` WRITE;

insert  into `score`(`score_id`,`score_course_id`,`score_student_id`,`score_num`,`score_year`,`score_semester`) values ('0a677a8eee','130600021','1300002004',10,'2010-2011','1'),('22be164f41','130600454','1300002004',20,'2010-2011','2'),('50490bcd87','130600062','1300002004',30,'2011-2012','3'),('63b4d9c926','130600087','1300002004',40,'2010-2011','2');

UNLOCK TABLES;

/*Table structure for table `users` */

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `users_id` varchar(10) NOT NULL COMMENT '用户学号（工号）',
  `users_password` varchar(100) NOT NULL COMMENT '用户密码',
  `users_name` varchar(100) NOT NULL COMMENT '用户姓名',
  `users_email` varchar(200) NOT NULL COMMENT '用户邮箱',
  `users_sex` varchar(5) NOT NULL DEFAULT '男' COMMENT '用户性别',
  `users_campus` varchar(100) NOT NULL COMMENT '用户所在校区',
  `users_school` varchar(100) NOT NULL COMMENT '用户所在学院',
  `users_major` varchar(100) NOT NULL COMMENT '用户所在专业（若是学生才需要填写）',
  `users_class` varchar(100) DEFAULT NULL COMMENT '用户所在班级（若是学生才需要填写）',
  `users_grade` varchar(10) NOT NULL COMMENT '用户所在年级（若是学生才需要填写）',
  `users_length` int(5) DEFAULT NULL COMMENT '用户学制（若是学生才需要填写）',
  `users_type` varchar(10) NOT NULL DEFAULT '学生' COMMENT '用户类型',
  PRIMARY KEY (`users_id`,`users_email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `users` */

LOCK TABLES `users` WRITE;

insert  into `users`(`users_id`,`users_password`,`users_name`,`users_email`,`users_sex`,`users_campus`,`users_school`,`users_major`,`users_class`,`users_grade`,`users_length`,`users_type`) values ('1300002001','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','张玲','1300002001@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002002','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','黄启样','1300002002@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002003','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈林浩','1300002003@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002004','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','姜喆','1300002004@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002005','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','王帅粤','1300002005@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002006','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈强生','1300002006@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002007','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','张碧红','1300002007@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002008','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','詹威垚','1300002008@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002009','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','黄升','1300002009@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002010','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','邓阳俊','1300002010@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002011','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','林义伟','1300002011@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002012','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','詹武警','1300002012@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002013','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈振聪','1300002013@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002014','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','张华','1300002014@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002015','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','张芳','1300002015@gzhu.edu.cn','女','大学城校区','','','','',0,'教师'),('1300002016','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','马志绅','1300002016@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002017','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','廖云枫','942770373@qq.com','男','大学城校区','','','','',0,'管理员'),('1300002018','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','何波','1300002018@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002019','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','白永睿','1300002019@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002020','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','郑志红','1300002020@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002021','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','吴丽烨','1300002021@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002022','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈锐锋','1300002022@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002023','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','刘华俊','1300002023@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002024','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','李金峰','1300002024@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002025','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','莫文诺','1300002025@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002026','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','黄裕明','1300002026@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002027','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈振生','1300002027@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002028','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','黄光义','1300002028@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002029','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陆扬奎','1300002029@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002030','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈健斌','1300002030@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002031','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','方伟榕','1300002031@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002032','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','叶海峰','1300002032@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002033','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','杜加威','1300002033@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002034','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','苏华生','1300002034@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002035','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','张金如','1300002035@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002036','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','叶泳锋','1300002036@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002037','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','孙国强','1300002037@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002038','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','林伟武','1300002038@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002039','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈盛绿','1300002039@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002040','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','胡康泽','1300002040@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002041','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','许茂','1300002041@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002042','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈锦川','1300002042@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002043','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','林超','1300002043@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002044','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','吴展材','1300002044@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002045','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈楚坤','1300002045@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002046','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','洪振健','1300002046@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002047','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','李旭','1300002047@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002048','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','方伟霞','1300002048@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002049','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','林进雄','1300002049@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002050','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈汉林','1300002050@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002051','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','李创盛','1300002051@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002052','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','江长娴','1300002052@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002053','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','林志文','1300002053@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002054','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','谭发新','1300002054@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002055','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','吴永顺','1300002055@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002056','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','沈美玲','1300002056@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002057','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','江紫红','1300002057@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002058','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','朱海东','1300002058@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002059','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈宜波','1300002059@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002060','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈伟州','1300002060@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002061','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','林昆','1300002061@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002062','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','蔡杰豪','1300002062@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002063','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','郭桦强','1300002063@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002064','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','何斯浩','1300002064@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002065','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','林志成','1300002065@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002066','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','叶天桥','1300002066@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002067','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','宋万财','1300002067@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002068','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','彭成亮','1300002068@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002069','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','宋仁胜','1300002069@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002070','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈永珍','1300002070@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002071','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','黎浩标','1300002071@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002072','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','刘泽楠','1300002072@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002073','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','潘洪亮','1300002073@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002074','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','葛俊鑫','1300002074@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002075','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','黄汉杰','1300002075@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002076','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','黄镜波','1300002076@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002077','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陆奕呈','1300002077@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002078','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','李展生','1300002078@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002079','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','马得中','1300002079@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002080','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','张媚','1300002080@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002081','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','周武杰','1300002081@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002082','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','谢子颖','1300002082@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002083','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','盘志伟','1300002083@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002084','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','叶菁','1300002084@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002085','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','李丽冰','1300002085@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002086','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','郑主霸','1300002086@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002087','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','李浩龙','1300002087@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002088','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','吴仕超','1300002088@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002089','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','郑怀彬','1300002089@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002090','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','梁旭昇','1300002090@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002091','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','关炜健','1300002091@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002092','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','梁碧兰','1300002092@gzhu.edu.cn','女','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002093','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','陈锐鹏','1300002093@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002094','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','朱锦塔','1300002094@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生'),('1300002095','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','王伟伦','1300002095@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科137','2013',4,'学生'),('1300002096','*FD571203974BA9AFE270FE62151AE967ECA5E0AA','梁颢议','1300002096@gzhu.edu.cn','男','大学城校区','计算机科学与教育软件学院','计算机科学与技术','计科138','2013',4,'学生');

UNLOCK TABLES;

/* Trigger structure for table `courses` */

DELIMITER $$

/*!50003 DROP TRIGGER*//*!50032 IF EXISTS */ /*!50003 `beforeDeleteAcourse` */$$

/*!50003 CREATE */ /*!50017 DEFINER = 'root'@'localhost' */ /*!50003 TRIGGER `beforeDeleteAcourse` BEFORE DELETE ON `courses` FOR EACH ROW BEGIN
	delete from score where score.score_course_id=OLD.courses_id;
    END */$$


DELIMITER ;

/* Trigger structure for table `users` */

DELIMITER $$

/*!50003 DROP TRIGGER*//*!50032 IF EXISTS */ /*!50003 `beforeDeleteAUser` */$$

/*!50003 CREATE */ /*!50017 DEFINER = 'root'@'localhost' */ /*!50003 TRIGGER `beforeDeleteAUser` BEFORE DELETE ON `users` FOR EACH ROW BEGIN
	delete from score where score.score_student_id=OLD.users_id;
    END */$$


DELIMITER ;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
